beattree-api/app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
    def index
        artists = Artist.all

INSERT INTO "artists" ("name", "email", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "rondon@aol.com"], ["email", "rondon@aol.com"], ["city", "rondon"], ["state", "rondon"], ["created_at", "2019-12-23 18:24:53.433459"], ["updated_at", "2019-12-23 18:24:53.433459"]]
---
    def create
        artist = Artist.new(artist_params)
        if artist.save